public class Main {
    public static void main(String[] args) {
        ГорячихНапитковАвтомат автомат = new ГорячихНапитковАвтомат();

        ГорячийНапитокСТемпературой кофе = new ГорячийНапитокСТемпературой("Кофе", 200, 80);
        ГорячийНапитокСТемпературой чай = new ГорячийНапитокСТемпературой("Чай", 150, 75);

        автомат.addProduct(кофе);
        автомат.addProduct(чай);

        ГорячийНапиток напиток = автомат.getProduct("Кофе", 200, 80);
        if (напиток != null) {
            System.out.println("Выдан напиток: " + напиток.getName());
        } else {
            System.out.println("Напиток не найден");
        }
    }
}
